In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd
'''Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.'''

'Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.'

In [5]:
l=[4, 8, 15, 16, 23,42]

In [6]:
l2=pd.Series(l)

In [7]:
print(l2)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [8]:
'''Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.'''

'Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the\nvariable print it.'

In [9]:
l3=[2,5,9,30,"nitin","datascience","Pwskills",34]

In [10]:
l4=pd.Series(l3)

In [11]:
print(l4)

0              2
1              5
2              9
3             30
4          nitin
5    datascience
6       Pwskills
7             34
dtype: object

In [14]:
'''Q3. Create a Pandas DataFrame that contains the following data:
Name
Alice
Bob
Claire Age 25 30 27 Geender Female Male Female'''

'Q3. Create a Pandas DataFrame that contains the following data:\nName\nAlice\nBob\nClaire Age 25 30 27 Geender Female Male Female'

In [18]:
nitin={'Name':['Alice','Bob','Claire'],'Age':[25,3, 27],'Gender':['Female','Male','Female']}

In [19]:
nitin2=pd.DataFrame(nitin)

In [20]:
print(nitin2)

     Name  Age  Gender
0   Alice   25  Female
1     Bob    3    Male
2  Claire   27  Female

In [21]:
'''Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.'''

'Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.'

In [22]:
'''DataFrame in pandas takes multiple table as data and data intake is usully of dictionary
format where its key is coulums and value as rows. the data type of the dictionary can be 
of any type.Wheras in series the data is one single one dimensional array> The data in series
can also be of any type'''

'DataFrame in pandas takes multiple table as data and data intake is usully of dictionary\nformat where its key is coulums and value as rows. the data type of the dictionary can be \nof any type.Wheras in series the data is one single one dimensional array> The data in series\ncan also be of any type'

In [24]:
l3=[23,'nitin',34,45,41]

In [25]:
l4=pd.Series(l3)

In [26]:
print(l4)

0       23
1    nitin
2       34
3       45
4       41
dtype: object

In [30]:
l5={'Name':['Pwskills','Datascience', 'webdev'],'Assignment':['powerBi','c++','python'], 'Fees':[3500,5000,20000]}

In [31]:
l6=pd.DataFrame(l5)

In [32]:
print(l6)

          Name Assignment   Fees
0     Pwskills    powerBi   3500
1  Datascience        c++   5000
2       webdev     python  20000

In [33]:
'''Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?'''

'Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can\nyou give an example of when you might use one of these functions?'

In [34]:
'''Some common function that can be used in python o manupulate data are '''

'Some common function that can be used in python o manupulate data are '

In [46]:
'''There are abundance of operation which can be performed in datarame some prominet function are'''

'There are abundance of operation which can be performed in datarame some prominet function are'

In [49]:
import seaborn as sns

In [50]:
iris = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')

In [52]:
iris.head() #it gives the first five data set of the DataFrme

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [53]:
iris.describe() #It gives sort of statistical analysis of the file whhich is associated with numbers

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [54]:
iris.head(3) #head and tail functiom the first five and last five data of the file 
            #but filling the number wihin 5 we can get the desireable data list within top and lst 5 dataset

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [56]:
iris['sepal_width'] #We can get the data of desirable column

0      3.5
1      3.0
2      3.2
3      3.1
4      3.6
      ...
145    3.0
146    2.5
147    3.0
148    3.4
149    3.0
Name: sepal_width, Length: 150, dtype: float64

In [57]:
iris[['sepal_width','petal_length']] #to get the data of multiple column we have to pass it as list

     sepal_width  petal_length
0            3.5           1.4
1            3.0           1.4
2            3.2           1.3
3            3.1           1.5
4            3.6           1.4
..           ...           ...
145          3.0           5.2
146          2.5           5.0
147          3.0           5.2
148          3.4           5.4
149          3.0           5.1

[150 rows x 2 columns]

In [60]:
iris['sepal_width']>3.0 #It gives True or False for the sepal width >3.0 
                        #to get the data in list formt we have pass it as list below

0       True
1      False
2       True
3       True
4       True
       ...
145    False
146    False
147    False
148     True
149    False
Name: sepal_width, Length: 150, dtype: bool

In [61]:
iris[iris['sepal_width']>3.0]

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
5             5.4          3.9           1.7          0.4     setosa
..            ...          ...           ...          ...        ...
140           6.7          3.1           5.6          2.4  virginica
141           6.9          3.1           5.1          2.3  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
148           6.2          3.4           5.4          2.3  virginica

[67 rows x 5 columns]

In [ ]:
'''we can perform many operation like max,min, sum, concat two data replace coloumn name,
add coloumn name, del coloumn name and many more operaions''''

In [35]:
'''Q6. Which of the following is mutable in nature Series, DataFrame, Panel?'''

'Q6. Which of the following is mutable in nature Series, DataFrame, Panel?'

In [36]:
'''Both series and dataframe are mutuable in nature but Panel in not. We can manupulate 
data in series and DataFrame of pandas as per our need.Panel is oudated and not updated constanly.'''

'Both series and dataframe are mutuable in nature but Panel in not. We can manupulate \ndata in series and DataFrame of pandas as per our need.Panel is oudated and not updated constanly.'

In [37]:
'''Q7. Create a DataFrame using multiple Series. Explain with an example.'''

'Q7. Create a DataFrame using multiple Series. Explain with an example.'

In [41]:
l8=pd.Series([3,6,7])#Here two series have been built up into one dataframe

In [43]:
l9=pd.Series([4,9,10])

In [44]:
l10=pd.DataFrame({'series1':l8,'series2':l9})

In [45]:
print(l10)

   series1  series2
0        3        4
1        6        9
2        7       10